orihikarna/Hermit/firmware/HermitLL/HermitLL.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=48000000
RCC.USART1Freq_Value=48000000
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
Dma.TIM3_CH3.0.Mode=DMA_CIRCULAR
I2C1.I2C_Speed_Mode=I2C_Fast
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F042K6Tx
RCC.PLLCLKFreq_Value=16000000
PA0.GPIO_Label=COL8
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-LL-true,2-MX_DMA_Init-DMA-false-LL-true,3-SystemClock_Config-RCC-false-LL-false,4-MX_I2C1_Init-I2C1-false-LL-true,5-MX_TIM3_Init-TIM3-false-LL-true,6-MX_USART2_UART_Init-USART2-false-LL-true,7-MX_TIM2_Init-TIM2-false-LL-true
PA9.GPIOParameters=GPIO_Label
Dma.TIM3_CH3.0.PeriphInc=DMA_PINC_DISABLE
PA6.GPIO_Label=ROW4
PB0.GPIO_Label=RDI
PB6.GPIO_Label=COL2
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PinOutPanel.RotationAngle=0
TIM3.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI48
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
Mcu.IP4=SYS
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=TIM2
I2C1.IPParameters=I2C_Speed_Mode,Timing
Mcu.IP2=NVIC
Mcu.IP3=RCC
PA15.GPIO_Label=COL5
PB4.GPIOParameters=GPIO_Label
Mcu.IP0=DMA
Mcu.IP1=I2C1
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=48000000
Mcu.IPNb=8
TIM2.IPParameters=Prescaler,Period
ProjectManager.PreviousToolchain=
TIM3.Period=11
PB6.Signal=GPIO_Input
Mcu.Pin6=PA4
Mcu.Pin7=PA5
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PA6
Mcu.Pin9=PB0
RCC.AHBFreq_Value=48000000
Mcu.Pin0=PF0-OSC_IN
Mcu.Pin1=PF1-OSC_OUT
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA0
Mcu.Pin3=PA1
Mcu.Pin4=PA2
Mcu.Pin5=PA3
ProjectManager.ProjectBuild=false
Dma.TIM3_CH4/UP.1.MemInc=DMA_MINC_ENABLE
PA0.Locked=true
PA4.Locked=true
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
MxDb.Version=DB.6.0.21
PB0.GPIOParameters=GPIO_Speed,GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
PB1.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA14.Mode=Serial_Wire
TIM3.Prescaler=4
PB1.GPIO_Label=LDI
File.Version=6
PA10.GPIO_Label=COL6
PB3.GPIOParameters=GPIO_Label
PB7.Signal=GPIO_Input
PB8.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.RequestsNb=2
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=HermitLL
PA0.Signal=GPIO_Input
RCC.PLLMCOFreq_Value=16000000
PB7.GPIO_Label=COL1
Dma.TIM3_CH3.0.MemInc=DMA_MINC_ENABLE
Mcu.Package=LQFP32
TIM2.Prescaler=47
PB1.Signal=S_TIM3_CH4
PA6.Signal=GPIO_Output
Dma.TIM3_CH3.0.Instance=DMA1_Channel2
PA5.Locked=true
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=GPIO_Input
PA15.Signal=GPIO_Input
PA5.GPIOParameters=GPIO_Label
PB5.GPIO_Label=ROW1
RCC.CECFreq_Value=32786.88524590164
Dma.Request1=TIM3_CH4/UP
RCC.APB1TimFreq_Value=48000000
Dma.TIM3_CH4/UP.1.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PF1-OSC_OUT.Mode=I2C
Dma.Request0=TIM3_CH3
PA4.GPIO_Label=ROW2
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PF1-OSC_OUT.Signal=I2C1_SCL
PB3.Locked=true
PB4.Signal=GPIO_Input
PA3.Signal=USART2_RX
PB3.GPIO_Label=COL4
PA6.GPIOParameters=GPIO_Label
RCC.I2SFreq_Value=48000000
ProjectManager.ProjectFileName=HermitLL.ioc
Dma.TIM3_CH3.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PB8.GPIOParameters=GPIO_Label
Dma.TIM3_CH3.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=25
TIM3.OCFastMode_PWM-PWM\ Generation3\ CH3=TIM_OCFAST_ENABLE
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
ProjectManager.NoMain=false
PA9.GPIO_Label=COL7
Dma.TIM3_CH3.0.Priority=DMA_PRIORITY_LOW
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
SH.S_TIM3_CH3.0=TIM3_CH3,PWM Generation3 CH3
USART2.BaudRate=115200
RCC.FamilyName=M
Dma.TIM3_CH3.0.Direction=DMA_MEMORY_TO_PERIPH
Dma.TIM3_CH4/UP.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PB0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA13.Signal=SYS_SWDIO
PA3.Mode=Asynchronous
TIM3.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
PB8.GPIO_Label=COLB
PA15.Locked=true
ProjectManager.TargetToolchain=STM32CubeIDE
SH.S_TIM3_CH3.ConfNb=1
PB7.GPIOParameters=GPIO_Label
Dma.TIM3_CH4/UP.1.PeriphInc=DMA_PINC_DISABLE
PA9.Signal=GPIO_Input
I2C1.Timing=0x0000020B
PB5.Locked=true
ProjectManager.RegisterCallBack=
Dma.TIM3_CH4/UP.1.Priority=DMA_PRIORITY_LOW
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
Dma.TIM3_CH4/UP.1.Direction=DMA_MEMORY_TO_PERIPH
PA1.Signal=GPIO_Output
PF0-OSC_IN.Mode=I2C
PA5.Signal=GPIO_Output
Dma.TIM3_CH4/UP.1.Mode=DMA_CIRCULAR
board=custom
ProjectManager.LastFirmware=false
RCC.VCOOutput2Freq_Value=8000000
Dma.TIM3_CH4/UP.1.Instance=DMA1_Channel3
MxCube.Version=6.2.1
PB4.GPIO_Label=COL3
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PA1.GPIO_Label=LED
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
TIM3.IPParameters=Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,Prescaler,Period,AutoReloadPreload,TIM_MasterOutputTrigger,OCFastMode_PWM-PWM Generation3 CH3,OCFastMode_PWM-PWM Generation4 CH4
PA9.Locked=true
Dma.TIM3_CH4/UP.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
TIM2.Period=0xffffffff
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F042K(4-6)Tx
PA2.Signal=USART2_TX
Mcu.Pin24=VP_TIM3_VS_ClockSourceINT
ProjectManager.UnderRoot=true
RCC.HSICECFreq_Value=32786.88524590164
Mcu.IP6=TIM3
Mcu.IP7=USART2
ProjectManager.CoupleFile=false
PB4.Locked=true
PB3.Signal=GPIO_Input
TIM3.OCFastMode_PWM-PWM\ Generation4\ CH4=TIM_OCFAST_ENABLE
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Pin22=VP_SYS_VS_Systick
PB5.Signal=GPIO_Output
Mcu.Pin23=VP_TIM2_VS_ClockSourceINT
RCC.TimSysFreq_Value=48000000
Mcu.Pin20=PB7
PA1.Locked=true
Mcu.Pin21=PB8
PA5.GPIO_Label=ROW3
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
Dma.TIM3_CH3.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PA14.Signal=SYS_SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PA15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB3
Mcu.Pin13=PA13
Mcu.Pin14=PA14
Mcu.Pin19=PB6
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB4
Mcu.Pin18=PB5
SH.S_TIM3_CH4.ConfNb=1
Mcu.Pin11=PA9
Mcu.Pin12=PA10
Mcu.Pin10=PB1
NVIC.DMA1_Channel2_3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB7.Locked=true
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Input
PF0-OSC_IN.Signal=I2C1_SDA
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_OC1REF
RCC.APB1Freq_Value=48000000
PB0.Signal=S_TIM3_CH3
ProjectManager.DeviceId=STM32F042K6Tx
ProjectManager.LibraryCopy=1
SH.S_TIM3_CH4.0=TIM3_CH4,PWM Generation4 CH4
PB1.GPIOParameters=GPIO_Speed,GPIO_Label
PA6.Locked=true
isbadioc=false
